{
  "architectures": ["GptOssForCausalLM"],
  "model_type": "gpt_oss",
  "vocab_size": 50257,
  "n_embd": 768,
  "n_layer": 12,
  "n_head": 12,
  "n_inner": 3072,
  "n_ctx": 2048,
  "max_position_embeddings": 2048,
  "hidden_act": "gelu",
  "activation_function": "gelu",
  "add_bias": true,
  "layer_norm_epsilon": 1e-5,
  "resid_pdrop": 0.1,
  "attn_pdrop": 0.1,
  "use_cache": false,
  "scale_attn_weights": true,
  "position_embedding_type": "learned",
  "tie_word_embeddings": true,
  "eos_token_id": 50256,
  "bos_token_id": 50256,
  "pad_token_id": 50256,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 0.95,
  "do_sample": true,
  "max_length": 100,
  "_comment": "This is an example configuration for GptOss model. Adjust parameters as needed for your specific model."
}